; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_4)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 link8 link9 link10 link11 link12 - link
    angle0 angle40 angle80 angle120 angle160 angle200 angle240 angle280 angle320 - angle)
(:init
    (AngleOrd angle0 angle40)
    (AngleOrd angle40 angle80)
    (AngleOrd angle80 angle120)
    (AngleOrd angle120 angle160)
    (AngleOrd angle160 angle200)
    (AngleOrd angle200 angle240)
    (AngleOrd angle240 angle280)
    (AngleOrd angle280 angle320)
    (AngleOrd angle320 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)
    (IsChildOf link8 link7)
    (IsChildOf link9 link8)
    (IsChildOf link10 link9)
    (IsChildOf link11 link10)
    (IsChildOf link12 link11)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)
    (Affected link8 link1)
    (Affected link8 link2)
    (Affected link8 link3)
    (Affected link8 link4)
    (Affected link8 link5)
    (Affected link8 link6)
    (Affected link8 link7)
    (Affected link9 link1)
    (Affected link9 link2)
    (Affected link9 link3)
    (Affected link9 link4)
    (Affected link9 link5)
    (Affected link9 link6)
    (Affected link9 link7)
    (Affected link9 link8)
    (Affected link10 link1)
    (Affected link10 link2)
    (Affected link10 link3)
    (Affected link10 link4)
    (Affected link10 link5)
    (Affected link10 link6)
    (Affected link10 link7)
    (Affected link10 link8)
    (Affected link10 link9)
    (Affected link11 link1)
    (Affected link11 link2)
    (Affected link11 link3)
    (Affected link11 link4)
    (Affected link11 link5)
    (Affected link11 link6)
    (Affected link11 link7)
    (Affected link11 link8)
    (Affected link11 link9)
    (Affected link11 link10)
    (Affected link12 link1)
    (Affected link12 link2)
    (Affected link12 link3)
    (Affected link12 link4)
    (Affected link12 link5)
    (Affected link12 link6)
    (Affected link12 link7)
    (Affected link12 link8)
    (Affected link12 link9)
    (Affected link12 link10)
    (Affected link12 link11)

    (HasAngle angle280 link1)
    (HasAngle angle40 link2)
    (HasAngle angle0 link3)
    (HasAngle angle200 link4)
    (HasAngle angle240 link5)
    (HasAngle angle160 link6)
    (HasAngle angle120 link7)
    (HasAngle angle0 link8)
    (HasAngle angle40 link9)
    (HasAngle angle280 link10)
    (HasAngle angle120 link11)
    (HasAngle angle240 link12)
)
(:goal
(and
    (HasAngle angle80 link1)
    (HasAngle angle40 link2)
    (HasAngle angle40 link3)
    (HasAngle angle40 link4)
    (HasAngle angle160 link5)
    (HasAngle angle240 link6)
    (HasAngle angle80 link7)
    (HasAngle angle200 link8)
    (HasAngle angle120 link9)
    (HasAngle angle40 link10)
    (HasAngle angle80 link11)
    (HasAngle angle80 link12)
    )
)
)

; plan
1. (increase_angle link1 angle280 angle320)
   deleted: (hasangle angle280 link1) (hasangle angle40 link2) (hasangle angle0 link3) (hasangle angle200 link4) (hasangle angle240 link5) (hasangle angle160 link6) (hasangle angle120 link7) (hasangle angle0 link8) (hasangle angle40 link9) (hasangle angle280 link10) (hasangle angle120 link11) (hasangle angle240 link12)
   added: (hasangle angle320 link1) (hasangle angle80 link2) (hasangle angle40 link3) (hasangle angle240 link4) (hasangle angle280 link5) (hasangle angle200 link6) (hasangle angle160 link7) (hasangle angle40 link8) (hasangle angle80 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle280 link12)
   goals met: 1 of 12
2. (increase_angle link1 angle320 angle0)
   deleted: (hasangle angle320 link1) (hasangle angle80 link2) (hasangle angle40 link3) (hasangle angle240 link4) (hasangle angle280 link5) (hasangle angle200 link6) (hasangle angle160 link7) (hasangle angle40 link8) (hasangle angle80 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle280 link12)
   added: (hasangle angle0 link1) (hasangle angle120 link2) (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle240 link6) (hasangle angle200 link7) (hasangle angle80 link8) (hasangle angle120 link9) (hasangle angle0 link10) (hasangle angle200 link11) (hasangle angle320 link12)
   goals met: 2 of 12
3. (increase_angle link1 angle0 angle40)
   deleted: (hasangle angle0 link1) (hasangle angle120 link2) (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle240 link6) (hasangle angle200 link7) (hasangle angle80 link8) (hasangle angle120 link9) (hasangle angle0 link10) (hasangle angle200 link11) (hasangle angle320 link12)
   added: (hasangle angle40 link1) (hasangle angle160 link2) (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle280 link6) (hasangle angle240 link7) (hasangle angle120 link8) (hasangle angle160 link9) (hasangle angle40 link10) (hasangle angle240 link11) (hasangle angle0 link12)
   goals met: 1 of 12
4. (increase_angle link1 angle40 angle80)
   deleted: (hasangle angle40 link1) (hasangle angle160 link2) (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle280 link6) (hasangle angle240 link7) (hasangle angle120 link8) (hasangle angle160 link9) (hasangle angle40 link10) (hasangle angle240 link11) (hasangle angle0 link12)
   added: (hasangle angle80 link1) (hasangle angle200 link2) (hasangle angle160 link3) (hasangle angle0 link4) (hasangle angle40 link5) (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle200 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   goals met: 1 of 12
5. (increase_angle link6 angle320 angle0)
   deleted: (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle200 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   added: (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle200 link8) (hasangle angle240 link9) (hasangle angle120 link10) (hasangle angle320 link11) (hasangle angle80 link12)
   goals met: 3 of 12
6. (decrease_angle link1 angle80 angle40)
   deleted: (hasangle angle80 link1) (hasangle angle200 link2) (hasangle angle160 link3) (hasangle angle0 link4) (hasangle angle40 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle200 link8) (hasangle angle240 link9) (hasangle angle120 link10) (hasangle angle320 link11) (hasangle angle80 link12)
   added: (hasangle angle40 link1) (hasangle angle160 link2) (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle200 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   goals met: 0 of 12
7. (increase_angle link10 angle80 angle120)
   deleted: (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   added: (hasangle angle120 link10) (hasangle angle320 link11) (hasangle angle80 link12)
   goals met: 1 of 12
8. (decrease_angle link3 angle120 angle80)
   deleted: (hasangle angle120 link3) (hasangle angle320 link4) (hasangle angle0 link5) (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle320 link11) (hasangle angle80 link12)
   added: (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle280 link6) (hasangle angle240 link7) (hasangle angle120 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   goals met: 0 of 12
9. (decrease_angle link2 angle160 angle120)
   deleted: (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle280 link4) (hasangle angle320 link5) (hasangle angle280 link6) (hasangle angle240 link7) (hasangle angle120 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   added: (hasangle angle120 link2) (hasangle angle40 link3) (hasangle angle240 link4) (hasangle angle280 link5) (hasangle angle240 link6) (hasangle angle200 link7) (hasangle angle80 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle240 link11) (hasangle angle0 link12)
   goals met: 4 of 12
10. (decrease_angle link4 angle240 angle200)
   deleted: (hasangle angle240 link4) (hasangle angle280 link5) (hasangle angle240 link6) (hasangle angle200 link7) (hasangle angle80 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle240 link11) (hasangle angle0 link12)
   added: (hasangle angle200 link4) (hasangle angle240 link5) (hasangle angle200 link6) (hasangle angle160 link7) (hasangle angle40 link8) (hasangle angle80 link9) (hasangle angle0 link10) (hasangle angle200 link11) (hasangle angle320 link12)
   goals met: 1 of 12
11. (decrease_angle link4 angle200 angle160)
   deleted: (hasangle angle200 link4) (hasangle angle240 link5) (hasangle angle200 link6) (hasangle angle160 link7) (hasangle angle40 link8) (hasangle angle80 link9) (hasangle angle0 link10) (hasangle angle200 link11) (hasangle angle320 link12)
   added: (hasangle angle160 link4) (hasangle angle200 link5) (hasangle angle160 link6) (hasangle angle120 link7) (hasangle angle0 link8) (hasangle angle40 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle280 link12)
   goals met: 1 of 12
12. (decrease_angle link4 angle160 angle120)
   deleted: (hasangle angle160 link4) (hasangle angle200 link5) (hasangle angle160 link6) (hasangle angle120 link7) (hasangle angle0 link8) (hasangle angle40 link9) (hasangle angle320 link10) (hasangle angle160 link11) (hasangle angle280 link12)
   added: (hasangle angle120 link4) (hasangle angle160 link5) (hasangle angle120 link6) (hasangle angle80 link7) (hasangle angle320 link8) (hasangle angle0 link9) (hasangle angle280 link10) (hasangle angle120 link11) (hasangle angle240 link12)
   goals met: 3 of 12
13. (decrease_angle link4 angle120 angle80)
   deleted: (hasangle angle120 link4) (hasangle angle160 link5) (hasangle angle120 link6) (hasangle angle80 link7) (hasangle angle320 link8) (hasangle angle0 link9) (hasangle angle280 link10) (hasangle angle120 link11) (hasangle angle240 link12)
   added: (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle80 link6) (hasangle angle40 link7) (hasangle angle280 link8) (hasangle angle320 link9) (hasangle angle240 link10) (hasangle angle80 link11) (hasangle angle200 link12)
   goals met: 2 of 12
14. (decrease_angle link4 angle80 angle40)
   deleted: (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle80 link6) (hasangle angle40 link7) (hasangle angle280 link8) (hasangle angle320 link9) (hasangle angle240 link10) (hasangle angle80 link11) (hasangle angle200 link12)
   added: (hasangle angle40 link4) (hasangle angle80 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle280 link9) (hasangle angle200 link10) (hasangle angle40 link11) (hasangle angle160 link12)
   goals met: 2 of 12
15. (decrease_angle link5 angle80 angle40)
   deleted: (hasangle angle80 link5) (hasangle angle40 link6) (hasangle angle0 link7) (hasangle angle240 link8) (hasangle angle280 link9) (hasangle angle200 link10) (hasangle angle40 link11) (hasangle angle160 link12)
   added: (hasangle angle40 link5) (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle200 link8) (hasangle angle240 link9) (hasangle angle160 link10) (hasangle angle0 link11) (hasangle angle120 link12)
   goals met: 3 of 12
16. (decrease_angle link6 angle0 angle320)
   deleted: (hasangle angle0 link6) (hasangle angle320 link7) (hasangle angle200 link8) (hasangle angle240 link9) (hasangle angle160 link10) (hasangle angle0 link11) (hasangle angle120 link12)
   added: (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle320 link11) (hasangle angle80 link12)
   goals met: 3 of 12
17. (decrease_angle link6 angle320 angle280)
   deleted: (hasangle angle320 link6) (hasangle angle280 link7) (hasangle angle160 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle320 link11) (hasangle angle80 link12)
   added: (hasangle angle280 link6) (hasangle angle240 link7) (hasangle angle120 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   goals met: 2 of 12
18. (decrease_angle link9 angle160 angle120)
   deleted: (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle280 link11) (hasangle angle40 link12)
   added: (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle240 link11) (hasangle angle0 link12)
   goals met: 4 of 12
19. (decrease_angle link11 angle240 angle200)
   deleted: (hasangle angle240 link11) (hasangle angle0 link12)
   added: (hasangle angle200 link11) (hasangle angle320 link12)
   goals met: 4 of 12
20. (decrease_angle link11 angle200 angle160)
   deleted: (hasangle angle200 link11) (hasangle angle320 link12)
   added: (hasangle angle160 link11) (hasangle angle280 link12)
   goals met: 4 of 12
21. (decrease_angle link11 angle160 angle120)
   deleted: (hasangle angle160 link11) (hasangle angle280 link12)
   added: (hasangle angle120 link11) (hasangle angle240 link12)
   goals met: 4 of 12
22. (decrease_angle link11 angle120 angle80)
   deleted: (hasangle angle120 link11) (hasangle angle240 link12)
   added: (hasangle angle80 link11) (hasangle angle200 link12)
   goals met: 5 of 12
23. (decrease_angle link12 angle200 angle160)
   deleted: (hasangle angle200 link12)
   added: (hasangle angle160 link12)
   goals met: 5 of 12
24. (decrease_angle link12 angle160 angle120)
   deleted: (hasangle angle160 link12)
   added: (hasangle angle120 link12)
   goals met: 5 of 12
25. (decrease_angle link6 angle280 angle240)
   deleted: (hasangle angle280 link6) (hasangle angle240 link7) (hasangle angle120 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle120 link12)
   added: (hasangle angle240 link6) (hasangle angle200 link7) (hasangle angle80 link8) (hasangle angle80 link9) (hasangle angle0 link10) (hasangle angle40 link11) (hasangle angle80 link12)
   goals met: 4 of 12
26. (decrease_angle link7 angle200 angle160)
   deleted: (hasangle angle200 link7) (hasangle angle80 link8) (hasangle angle80 link9) (hasangle angle0 link10) (hasangle angle40 link11) (hasangle angle80 link12)
   added: (hasangle angle160 link7) (hasangle angle40 link8) (hasangle angle40 link9) (hasangle angle320 link10) (hasangle angle0 link11) (hasangle angle40 link12)
   goals met: 3 of 12
27. (decrease_angle link7 angle160 angle120)
   deleted: (hasangle angle160 link7) (hasangle angle40 link8) (hasangle angle40 link9) (hasangle angle320 link10) (hasangle angle0 link11) (hasangle angle40 link12)
   added: (hasangle angle120 link7) (hasangle angle0 link8) (hasangle angle0 link9) (hasangle angle280 link10) (hasangle angle320 link11) (hasangle angle0 link12)
   goals met: 3 of 12
28. (decrease_angle link7 angle120 angle80)
   deleted: (hasangle angle120 link7) (hasangle angle0 link8) (hasangle angle0 link9) (hasangle angle280 link10) (hasangle angle320 link11) (hasangle angle0 link12)
   added: (hasangle angle80 link7) (hasangle angle320 link8) (hasangle angle320 link9) (hasangle angle240 link10) (hasangle angle280 link11) (hasangle angle320 link12)
   goals met: 4 of 12
29. (decrease_angle link8 angle320 angle280)
   deleted: (hasangle angle320 link8) (hasangle angle320 link9) (hasangle angle240 link10) (hasangle angle280 link11) (hasangle angle320 link12)
   added: (hasangle angle280 link8) (hasangle angle280 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle280 link12)
   goals met: 4 of 12
30. (decrease_angle link8 angle280 angle240)
   deleted: (hasangle angle280 link8) (hasangle angle280 link9) (hasangle angle200 link10) (hasangle angle240 link11) (hasangle angle280 link12)
   added: (hasangle angle240 link8) (hasangle angle240 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle240 link12)
   goals met: 4 of 12
31. (decrease_angle link8 angle240 angle200)
   deleted: (hasangle angle240 link8) (hasangle angle240 link9) (hasangle angle160 link10) (hasangle angle200 link11) (hasangle angle240 link12)
   added: (hasangle angle200 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle200 link12)
   goals met: 5 of 12
32. (decrease_angle link9 angle200 angle160)
   deleted: (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle200 link12)
   added: (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle160 link12)
   goals met: 5 of 12
33. (decrease_angle link9 angle160 angle120)
   deleted: (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle160 link12)
   added: (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle120 link12)
   goals met: 8 of 12
34. (increase_angle link1 angle40 angle80)
   deleted: (hasangle angle40 link1) (hasangle angle120 link2) (hasangle angle40 link3) (hasangle angle40 link4) (hasangle angle40 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle120 link12)
   added: (hasangle angle80 link1) (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle80 link4) (hasangle angle80 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle160 link12)
   goals met: 1 of 12
35. (decrease_angle link2 angle160 angle120)
   deleted: (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle80 link4) (hasangle angle80 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle160 link12)
   added: (hasangle angle120 link2) (hasangle angle40 link3) (hasangle angle40 link4) (hasangle angle40 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle120 link12)
   goals met: 9 of 12
36. (decrease_angle link12 angle120 angle80)
   deleted: (hasangle angle120 link12)
   added: (hasangle angle80 link12)
   goals met: 10 of 12
37. (increase_angle link5 angle40 angle80)
   deleted: (hasangle angle40 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle80 link12)
   added: (hasangle angle80 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   goals met: 3 of 12
38. (increase_angle link4 angle40 angle80)
   deleted: (hasangle angle40 link4) (hasangle angle80 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   added: (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle320 link6) (hasangle angle160 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle160 link12)
   goals met: 2 of 12
39. (decrease_angle link6 angle320 angle280)
   deleted: (hasangle angle320 link6) (hasangle angle160 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle160 link12)
   added: (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   goals met: 2 of 12
40. (decrease_angle link2 angle120 angle80)
   deleted: (hasangle angle120 link2) (hasangle angle40 link3) (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   added: (hasangle angle80 link2) (hasangle angle0 link3) (hasangle angle40 link4) (hasangle angle80 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle80 link12)
   goals met: 9 of 12
41. (increase_angle link3 angle0 angle40)
   deleted: (hasangle angle0 link3) (hasangle angle40 link4) (hasangle angle80 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle80 link12)
   added: (hasangle angle40 link3) (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   goals met: 2 of 12
42. (increase_angle link3 angle40 angle80)
   deleted: (hasangle angle40 link3) (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   added: (hasangle angle80 link3) (hasangle angle120 link4) (hasangle angle160 link5) (hasangle angle320 link6) (hasangle angle160 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle160 link12)
   goals met: 2 of 12
43. (decrease_angle link2 angle80 angle40)
   deleted: (hasangle angle80 link2) (hasangle angle80 link3) (hasangle angle120 link4) (hasangle angle160 link5) (hasangle angle320 link6) (hasangle angle160 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle160 link12)
   added: (hasangle angle40 link2) (hasangle angle40 link3) (hasangle angle80 link4) (hasangle angle120 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   goals met: 3 of 12
44. (increase_angle link5 angle120 angle160)
   deleted: (hasangle angle120 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   added: (hasangle angle160 link5) (hasangle angle320 link6) (hasangle angle160 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle160 link12)
   goals met: 4 of 12
45. (decrease_angle link6 angle320 angle280)
   deleted: (hasangle angle320 link6) (hasangle angle160 link7) (hasangle angle280 link8) (hasangle angle200 link9) (hasangle angle120 link10) (hasangle angle160 link11) (hasangle angle160 link12)
   added: (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   goals met: 4 of 12
46. (decrease_angle link4 angle80 angle40)
   deleted: (hasangle angle80 link4) (hasangle angle160 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   added: (hasangle angle40 link4) (hasangle angle120 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle80 link12)
   goals met: 11 of 12
47. (increase_angle link5 angle120 angle160)
   deleted: (hasangle angle120 link5) (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle80 link12)
   added: (hasangle angle160 link5) (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   goals met: 5 of 12
48. (decrease_angle link6 angle280 angle240)
   deleted: (hasangle angle280 link6) (hasangle angle120 link7) (hasangle angle240 link8) (hasangle angle160 link9) (hasangle angle80 link10) (hasangle angle120 link11) (hasangle angle120 link12)
   added: (hasangle angle240 link6) (hasangle angle80 link7) (hasangle angle200 link8) (hasangle angle120 link9) (hasangle angle40 link10) (hasangle angle80 link11) (hasangle angle80 link12)
   goals met: 12 of 12
